doom/.doom.d/packages.el

(package! keycast)

(package! gif-screencast)

(package! page-break-lines :recipe (:host github :repo "purcell/page-break-lines"))
